In [1]:
import numpy as np
import pandas as pd

In [2]:
dist = {
    "name":['Vivek', 'Pawan', 'Kiran', 'Mohit'],
    "marks": [24, 34, 22, 1],
    "city":['Jalandhar', 'Rishikesh', 'Pune', 'Patna']
}
dist

{'name': ['Vivek', 'Pawan', 'Kiran', 'Mohit'],
 'marks': [24, 34, 22, 1],
 'city': ['Jalandhar', 'Rishikesh', 'Pune', 'Patna']}

In [3]:
df = pd.DataFrame(dist)
df

    name  marks       city
0  Vivek     24  Jalandhar
1  Pawan     34  Rishikesh
2  Kiran     22       Pune
3  Mohit      1      Patna

In [4]:
df.to_csv('friends.csv')

In [5]:
df.head(2)

    name  marks       city
0  Vivek     24  Jalandhar
1  Pawan     34  Rishikesh

In [6]:
df.describe()

           marks
count   4.000000
mean   20.250000
std    13.865425
min     1.000000
25%    16.750000
50%    23.000000
75%    26.500000
max    34.000000

In [7]:
train = pd.read_csv('vivek.csv')
train

   Train no Tname   code       city
0       124    VV   24df  Jalandhar
1      3345    TT    sdf  Rishikesh
2       345    ak  wer34       Pune
3       345    rt    13f      Patna

In [8]:
train['code']

0     24df
1      sdf
2    wer34
3      13f
Name: code, dtype: object

In [9]:
train['code'][0]

'24df'

In [12]:
ser = pd.Series(np.random.rand(10))

In [13]:
ser

0    0.601365
1    0.381891
2    0.660506
3    0.230515
4    0.548959
5    0.798461
6    0.617765
7    0.891138
8    0.669511
9    0.488886
dtype: float64

In [15]:
newdf = pd.DataFrame(np.random.rand(343, 5), index = np.arange(343))

In [16]:
newdf

            0         1         2         3         4
0    0.468468  0.849496  0.243714  0.530413  0.679727
1    0.172124  0.959683  0.905709  0.778006  0.769508
2    0.540864  0.954172  0.320976  0.916964  0.290370
3    0.354177  0.627933  0.827419  0.927723  0.109371
4    0.113121  0.413756  0.695783  0.634937  0.614159
..        ...       ...       ...       ...       ...
338  0.260334  0.952502  0.837527  0.091066  0.576569
339  0.167563  0.390717  0.218270  0.455525  0.608579
340  0.416546  0.355585  0.473064  0.418996  0.805456
341  0.140612  0.771119  0.119568  0.130758  0.443738
342  0.826515  0.576492  0.854974  0.169631  0.538068

[343 rows x 5 columns]

In [17]:
type(ser)

pandas.core.series.Series

In [18]:
type(newdf)

pandas.core.frame.DataFrame